Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Для числовых столбцов метка класса состоит из верхней и нижней границ класса (для нулевого класса указывается только нижняя граница с предлогом «от…», для класса с максимальным номером указывается верхняя граница с предлогом «до…»).
en: The class caption of the numeric columns consists of the upper and lower class bounds (only the lower bound is specified for the null class with "from..." preposition, the upper bound is specified for the class with the maximum number with "to..." preposition).

source: Для эксперта предназначена панель сценариев, в которой он строит различные модели.
en: The workflows panel is designated for the expert to build different models in it.

source: Для этих целей в нем можно использовать фильтр Ходрика-Прескотта или один из трех типов вейвлетов - вейвлеты Добеши, Койфлеты и CDF 9/7.
en: The Hodrick-Prescott filter or one of three wavelet types (Daubechies, Coiflet and CDF 9/7 wavelets) can be used for these purposes in it.

source: Для этого в списке Таблица/Представление необходимо отметить поля объекта БД, выбранного в списке Таблицы/Представления.
en: For this purpose, it is required to select fields of the DB object in the Table/View list that was selected in the Tables/Views list.

source: Для этого выходные данные порта узла подключения необходимо подать на входной порт нуждающегося в этом подключении узла импорта/экспорта (см.
en: For this purpose, port data of the connection node are to be sent to the input port for which such connection of the import/export node is required (refer to

source: Для этого доступны следующие алгоритмы сжатия:
en: The following compression algorithms are available for this purpose:

source: Для этого используется встроенный модуль "builtIn/Calc".
en: For this purpose, it is required to use the built-in module - "builtIn/Calc".

source: Для этого используется компонент Фильтр строк, в мастере которого задается условие: "№ Номер строки <= 10".
en: For this purpose, the Row Filter component is used. "№ Row number <= 10" criteria is set in its wizard.

source: Для этого используется следующая формула:
en: The following formula is used for this purpose:

source: Для этого используют порт порядка выполнения .
en: For this purpose, the execution order port is used .

source: Для этого метода так же можно задать верхнюю и нижнюю границы.
en: Upper and lower bounds can be also set for this method.

source: Для этого можно воспользоваться горячей клавишей F2, предварительно выделив нужный узел.
en: For this purpose, it is possible to use F2 hotkey. First, you are to select the required node.

source: Для этого на вкладке SQL запрос задается текст запроса к базе данных.
en: For this purpose, it is required to enter text of the database query in the SQL query tab.

source: Для этого на панели инструментов нужно сделать активным режим приближения и далее следует, удерживая левую кнопку мыши нажатой, выделить ту область диаграммы, которую нужно просмотреть более детально.
en: For this purpose, it is required to enable pointer mode on the toolbar, and then it is required to select the chart area that must be viewed in more details by holding down the left mouse button.

source: Для этого не требуются дополнительные настройки, достаточно выполнить параллельное соединение узлов.
en: For this purpose, additional settings are not required. It is sufficient to execute the parallel connection of nodes.

source: Для этого необходимо создать соответствующее подключение:
en: For this purpose, it is required to create corresponding connection:

source: Для этого необходимо выделить узел, который нужно переместить и нажать на кнопки Переместить вверхПереместить вверх (комбинация горячих клавиш Ctrl+Up) или Переместить внизПереместить вниз (комбинация горячих клавиш Ctrl+Down).
en: For this purpose, it is required to select the node to be moved and press Move upMove up button (hotkeys combination - Ctrl+Up) or Move downMove down (hotkeys combination - Ctrl+Down).

source: Для этого необходимо выделить эти узлы и при помощи кнопки создать подмодель.
en: For this purpose, it is required to select these nodes and using button create a supernode.

source: Для этого необходимо нажать кнопку Восстановить порядок полей.
en: For this purpose, it is required to press Restore fields order button.

source: Для этого необходимо нажать на адресную строку и ввести новый/скорректированный путь.
en: In order to do that, it is required to press address bar and enter the new/corrected path.

source: Для этого необходимо щелкнуть мышью по заголовку таблицы (Главная таблица или Присоединяемая таблица).
en: For this purpose, it is required to click on the table header (Main table or Joined table).

source: Для этого необходимо, удерживая левой кнопкой мыши, перетащить (Drag&Drop) нужные поля в область построения диаграммы: в верхнюю часть — задается ось Y; в нижнюю часть — ось X.
en: For this purpose, it is required to drag (Drag&Drop) necessary fields to the chart construction area holding down with the left mouse button: to the upper part - the Y axis is st, to the lower part - the X axis is set.

source: Для этого нужно выбрать метку и нажать на кнопку на линии связи.
en: In order to do that, it is required to select the caption and press button in the line.

source: Для этого нужно выделить корневой узел и вызвать соответствующую команду контекстного меню.
en: For this purpose, it is required to select the root node and call corresponding command of the context menu.

source: Для этого нужно нажать на заголовок столбца с количеством преобразований.
en: In order to do that, it is required to press header of the column with the number of transformations.

source: Для этого нужно открыть выпадающее меню, нажав кнопку Открыть выпадающее меню, которая появляется при наведении курсора на заголовок Столбец или IV.
en: For this purpose, it is required to open pop-down menu by pressing Open pop-down menu button that appears when cursor hovering over Column or IV caption.

source: Для этого нужно:
en: In this regard, it is required to perform the following actions:

source: Для этого переместим компонент Группировка в рабочую область сценария.
en: For this purpose, trasfer the Grouping component to the working workflow area.

source: Для этого пригодны только поля числовых типов.
en: Only numeric fields are suitable for this purpose.

source: Для этого рекомендуется у всех публикуемых пакетов использовать настройку Генерировать уникальное для пакета или Генерировать уникальное для каждой версии пакета, либо задавать уникальные пространства имён вручную.
en: For this purpose, it is recommended to use Generate unique for package or Generate unique for each package version option for all published packages, or to set the unique namespaces manually.

source: Для этого следует вызвать вышеуказанную процедуру для узла верхнего уровня в иерархии вложенности.
en: For this purpose, it is required to call the specified above procedure for the upper level node in the nesting hierarchy.

source: Для этого существует возможность задать каждому пользователю свою роль.
en: For this purpose, it is possible to assign each user his own role.

source: Для ячеей, в которых текст полностью не помещается, предусмотрены всплывающие подсказки.
en: Screen tooltips are used for the cells in which there is no enough place for text.

source: Добавить выделенные поля в список Выбранные поля можно:
en: It is possible to add the selected fields to the Selected fields list using the following ways:

source: Добавлены необязательные свойства require.resolve и require.cache (как в NodeJS);
en: require.resolve and require.cache (as in NodeJS) optional properties were added.

source: Добавляет спереди заданного выражения нули так, чтобы длина результирующей строки равнялась Общей\_длине.
en: Adds zeros at the front of the specified expression so that the resulting string length is equal to the Total\_length.

source: Добавляется поле "тестовое множество": в этом поле значение "true" свидетельствует о том, что запись попала в тестовую выборку, а значение "false" — в обучающую.
en: The "test set" field is added. The "true" value in this field means that the record has been placed into the test sample, whereas the "false" value has been placed into the training one.

source: Добавлять в следующий — перенесет значения совпадающих наблюдений в следующий (более высокий) интервал разделения.
en: Add to next: moves the values of matching observations to the next (higher) separation bin.

source: Добавляются новые выходные поля/переменные на основе входных полей, у которых еще нет связей.
en: New output fields/variables on the basis of the output fields that still do not have links are added.

source: Доверительный интервал прогноза в % от 0 до 100 — значение вещественного типа, по умолчанию 95.
en: Confidence forecast interval in % from 0 to 100: the real value. By default, it is 95.

source: Должно быть целым числом >= 1 (по умолчанию = 10).
en: It must be integer>= 1 (by default = 10).

source: Долю;
en: Rate

source: Доля
en: Rate

source: Доля (см.
en: Rate (refer to

source: Доля городского населения, %
en: Proportion of the urban population, %

source: Доля конечного класса от общего объема записей
en: The coarse class rate based on the total volume of records

source: Дополнительная информация
en: Additional Information

source: Дополнительно раскрытие рекурсивных узлов можно проводить вручную после построения дерева.
en: Additional opening of recursive nodes is possible in the manual mode upon tree building.

source: Дополнительно.
en: Additional.

source: Дополнительные варианты замены выводятся в результирующем наборе данных отдельным столбцом.
en: Additional replacement options are displayed in the resulting data set in the form of a separate column.

source: Дополнительные данные о результатах выполнения каждого запроса.
en: Additional data on the results of each request execution.

source: Дополнительные параметры
en: Additional Parameters

source: Допустим, у нас есть прогноз сумм продаж, составленный для двух товарных групп, и нам нужно выявить из этого прогноза суммы продаж для отдельных товаров.
en: Let us consider the sales amount forecast made for two groups of goods, and we need to define the sales amounts for separate goods according to this forecast.

source: Допустимо сопоставление полей (переменных) следующих типов данных:
en: Mapping of the fields (variables) of the following data types is allowed:

source: Допустимые режимы пакетной обработки
en: Valid modes of batch processing

source: Допустимый интервал
en: Allowable interval

source: Допустимыми значениями Логического типа считаются true и false (без учёта регистра).
en: true and false (non-case-sensitive) are considered to be allowable values of the Logical type.

source: Достичь максимальную производительность;
en: To provide the maximum performance.

source: Доступ из кода JavaScript к данным портов и другим встроенным объектам
en: Access to the Ports Data and Other Built-In Objects from the JavaScript Code

source: Доступен в мастерах Импорт из базы данных, Импорт из 1С и JavaScript.
en: It is available in Import from database, Import from 1С and JavaScript wizards.

source: Доступен во всех Пакетах (чтобы использовать объект из другого Пакета, надо создать Ссылку на этот Пакет)
en: It is available in all Packages (to use the object from another Package, it is required to create a Reference to this Package)

source: Доступен во всех Пакетах и в виде Веб-сервиса (данный модификатор задается при публикации узла в виде Веб-сервиса)
en: It is available in all Packages and in the Web Service form (this access modifier is set when publishing the node in the Web Service form)

source: Доступен как выбор из списка предопределенных значений, так и ввод произвольного значения.
en: It is allowed both to select from the list of predefined values, and to enter a random value.

source: Доступен только внутри текущего Модуля
en: It is available only in the current Module

source: Доступен только внутри текущего Модуля и его Подмоделей
en: It is available only in the current Module and its Supernodes

source: Доступен только внутри текущего Пакета
en: It is available only in the current Package

source: Доступно для типа события Задано явно.
en: It is available for the event of Explicitly set type.

source: Доступность некоторых методов обработки зависит от состояния данного флага.
en: Availability of some elimination methods depends on the status of this checkbox.

source: Доступность показателя для определенного поля зависит от типа и вида данных этого поля.
en: Availability of the given field indicator depends on the data type and kind of this field.

source: Доступность узлов определяется их видимостью (см.
en: Availability of nodes is defined by their visibility (refer to

source: Доступны все функции, включая реализованные в плагинах, за исключением следующих:
en: All functions are available, including the ones implemented in plugins, with the exception of the following ones:

source: Доступны горячие клавиши, дублирующие некоторые перечисленные команды:
en: The following hotkeys duplicating some listed commands are available:

source: Доступны горячие клавиши, дублирующие перечисленные команды:
en: The following hotkeys duplicating the listed commands are available:

source: Доступны следующие варианты.
en: The following options are available:

source: Доступны следующие методы обработки:
en: The following processing methods are available:

source: Доступны следующие опции:
en: The following options are available:

source: Доступны следующие типы диаграмм:
en: The following types of charts are available:

source: Доступные варианты:
en: There are the following available options:

source: Доступные действия представлены в виде кнопок на панели инструментов и в контекстном меню:
en: Available actions are represented in the form of the toolbar buttons and in the context menu:

source: Доступные для выбора показатели:
en: The indicators available for selection:

source: Доступные значения:
en: Available values:

source: Доступные значения: ?, null, NULL.
en: There are the following available values: ?, null, NULL.

source: Доступные значения: False, Ложь, Нет.
en: There are the following available values: False, False, No.

source: Доступные значения: True, Истина, Да.
en: There are the following available values: True, True, Yes.

source: Доступные параметры:
en: Available Parameters:

source: Доступные поля
en: Available Fields

source: Доступные разделители:
en: Available delimiters:

source: Доступные элементы
en: Available Items

source: Доступным способом открыть Свойства приложения (в данном случае – C:\Program Files\BaseGroup\Loginom 6\Personal\Embedded.exe).
en: It is required to open the application Properties using any available method (in this case, C:\Program Files\BaseGroup\Loginom 6\Personal\Embedded.exe).

source: Доходы на человека (руб./мес.)
en: Per capita income (rub./mon.)

source: Драйвера для MySQL
en: Drivers for MySQL

source: Драйвера для Oracle
en: Drivers for Oracle

source: Драйвера для PostgreSQL
en: Drivers for PostgreSQL

source: Драйвера для Sybase/Adaptive Server Enterprise
en: Drivers for Sybase/Adaptive Server Enterprise

source: Древовидные данные можно передавать на вход и выход обработчиков (аналогично набору данных и переменным) через порт соответствующего типа, а также передавать в опубликованный пакет через Интегратор (см.
en: The tree-like data can be passed to input and output of handlers (similar to data set and variables) through the corresponding port, and also to the published package through Integrator (also refer to

source: Другие ключи запуска можно посмотреть на соответствующих сайтах по командной строке Windows.
en: Other start keys are available on corresponding sites related to the Windows command line.

source: Другие узлы Пакета выполняться не будут.
en: Other Package nodes will not be executed.

source: Его можно выбрать, при этом также выбирается и узел массива.
en: It can be selected but the array node can be selected as well.

source: Его можно разделить на четыре основные области (см.
en: It can be divided into four main areas (refer to

source: Ее можно открыть нажатием на кнопку , расположенную в левом нижнем углу.
en: It can be opened by pressing button located in the left low corner.

source: Ее отличительной особенностью является исключение корреляционной зависимости между наблюдениями внутри лагов, т.е. частная автокорреляционная функция на каждом лаге отличается от обычной автокорреляционной функции на величину удаленных автокорреляций с меньшими временными лагами.
en: Its distinctive feature is exclusion of the correlation dependence between the observations inside the lags, namely, partial autocorrelation function in each lag differs from the standard autocorrelation function by the value of remote autocorrelations with smaller time lags.

source: Если p=FKhi2(N, X), то InvKhi2(N, P) = X
en: If p=FKhi2(N, X), then InvKhi2(N, P) = X

source: Если Порядок положительный, то поиск происходит слева направо, если отрицательный, то справа налево.
en: If the MatchIndex is positive, the search is performed from left to right, if it is negative, the search is performed from right to left.

source: Если Порядок равен нулю, то функция возвращает Неопределенное значение (Null).
en: If the MatchIndex is equal to zero, the function will return the Null value (Null).

source: Если авторизация для выполнения запроса отличается от авторизации для получения WSDL, то необходимо снять флаг и настроить необходимые параметры.
en: If the request authorization differs from the WSDL authorization, it is required to deselect the checkbox and set the required parameters.

source: Если в базовом узле изменять настройки, то в производном узле будут обновлены только те настройки, которые не были переопределены пользователем.
en: If the base node settings are changed, only the settings that have not been overdetermined by a user will be updated in the derived node.

source: Если в качестве признака группы указываются уникальные идентификаторы строк входного набора, то такая группа будет содержать только одну строку.
en: If unique identifiers of the input data set rows are specified as the group parameter, such group will contain only one row.

source: Если в поле Условие выбран вариант в списке или вне списка, то в поле Значение появится возможность отредактировать список, по которому будет проводится сравнение.
en: If listed or not listed option is selected in the Condition field, it will be possible to edit the list used for comparison in the Value field.

source: Если в текущем пакете настроены ссылки на внешние пакеты, то в дереве в отдельных ветках отобразятся узлы этих пакетов.
en: If the current package contains configured links to the external packages, the nodes of these packages will be displayed in the separate tree branches.

source: Если в текущий момент времени не выполняется ни один из процессов, а также не было ошибок у процессов завершенных, то в информационной панели данные будут отсутствовать.
en: If none of the processes is executed at the moment, and there were no errors in the completed processes, there will be no data on the information panel.

source: Если в чекбоксе заголовка поля поставить флажок, то все пользователи будут выделены как имеющие права на доступ к папке.
en: If a checkbox is selected in the field heading, all users will be selected as the ones with folder access rights.

source: Если во входной набор добавился ещё 1 товар
en: If one more item of goods was added to the input data set

source: Если все ветви примут значение "ложь", то будет активизирована специальная ветвь Иначе.
en: If all branches have the "false" value, the special Otherwise branch will be activated.

source: Если все переменные имеют Переменный тип, то они получат следующие значения:
en: If all variables refer to the Variable type, they get the following values:

source: Если входной источник данных содержит настройки разбиения для данного столбца, то в мастере для него выбирается назначение "Входное (внешнее разбиение)".
en: If the input data source contains binning settings for this column, "Input (external binning)" usage type is selected for it in the wizard.

source: Если вхождения заданного порядка нет, то функция возвращает 0.
en: If there is no occurrence of the set order, the function returns 0.

source: Если выделен кластер Итого, тогда набор данных детализации совпадает со входным.
en: If Total cluster has been selected, the detailing data set matches the input one.

source: Если выделено несколько ячеек, то возможна смена текущего поля:
en: If several cells are selected, the following change of the current field is possible:

source: Если выражение ложно, то сообщение об ошибке выводится в консоль.
en: If the expression is false, the error message is output to the console.

source: Если данные переменные не будут определены во входном порту узла импорта, то возникнет исключение.
en: If these variables are not determined in the input port of the import node, there will be an exception.

source: Если данный флаг стоит, то ошибки из-за непроверенного сертификата игнорируются, иначе подключение не произойдет.
en: If this checkbox is selected, errors caused by untested certificate are ignored, otherwise connection will not be established.

source: Если драйвер не находится в данном списке, то настроить подключение к нему возможно только через выбор уже настроенного источника данных.
en: If the driver is not listed, it is possible to set up a connection to it only by selecting already configured data source.

source: Если же на вход подана таблица, то поле обозначает не одно значение, а целую колонку.
en: If a table is supplied to the input, the field will denote not only one value but the whole column.

source: Если же с клиента приходит любое сообщение, то таймер сбрасывается, т.е. специальное сообщение отправляется только в том случае, если по каналу связи долго не приходило ни одного входящего сообщения.
en: If any message is sent from the client, the timer is reset. Namely, the special message is sent only if no incoming message has been sent by the connection channel for a long period of time.

source: Если значение не содержит указание временной зоны, то:
en: If the time zone is not specified for the value, the following conditions are met:

source: Если значение признака отклоняется от медианы более, чем на заданное число интерквартильного размаха, то оно считается аномальным.
en: If the indicator value deviates from the median more than by the set number of the interquartile range, it is considered to be anomalous.

source: Если значение содержит указание временной зоны, оно преобразуется к текущей временной зоне сервера Loginom.
en: If the time zone is specified for the value, it is transformed to the current time zone of the Loginom server.

source: Если имя переменной заканчивается на цифру, то в таких случаях в выходном наборе имена таких переменных пронумеруются по возрастающей.
en: If the variable name ends with a digit, in this case, names of these variables are numbered in an ascending order in the output data set.

source: Если исходное значение заключено в одинарные кавычки, то эти кавычки разэкранируются, в противном случае исходное значение присваивается в переменную без изменений.
en: If the source value is enclosed in single quotes, these quotes are unescaped. Otherwise, the source value is assigned to the variable without changes.
